import React from 'react'

const About = () => {
    return (
        <div className="vh-100 d-flex align-items-center justify-content-center">
            <div className="m-5 p-3 mb-5 bg-light rounded" >
                <p>Привет! Меня зовут Илья Пономарев, мне 28 лет, я из города Краснодар!
                    В 2021 году я начал изучать frontend: HTML, CSS, javascript, react. </p>
                <p>На сегодняшний день я нахожусь в поисках работы и в первую очередь в поиске хорошей команды,
                    с которой я смогу расти и совершенствовать свой скилл.</p>
                <p>
                    За несколько месяцев изучения фронтенда я самостоятельно реализовал несколько проектов, включая проекты,
                    построенные на библиотеке React. Я получаю большое удовольствие, когда сталкиваюсь с той или иной казалось
                    бы «трудноразрешимой» задачей, и еще большее удовольствие, когда нахожу верное решение.</p>
                <p>Я считаю, что самостоятельное изучение имеет как свои плюсы, так и минусы:
                    из плюсов в первую очередь я могу назвать то, что возможно, ты усваиваешь материал быстрее, чем другие, и
                    это позволяет тебе двигаться быстрее и дальше. Однако есть и большой минус, с которым столкнулся я:
                    этот минус – пропажа мотивации: когда идеи заканчиваются, ты можешь сильно застрять на одном месте,
                    спасают только тестовые задания, хотя хочется идти вперед и изучать frontend вглубь!</p>
                <p>Стек: HTML, CSS, JavaScript, React, Redux, Redux-thunk, React-hook-form, Figma, Git.</p>
                <p><a href='https://github.com/ka1h2h' target='_blank'>Github</a></p>
                <p><a href='https://instagram.com/ka1h2h?igshid=YmMyMTA2M2Y=' target='_blank'>Instagram</a></p>
                О себе коротко: уже несколько лет я тренирую людей фитнесу и пауэрлифтингу, сам являюсь выступающим спортсменом
                в классическом троеборье. Тренируюсь 11 лет. Всех разрядов, званий и побед здесь перечислять не буду. Спасибо за внимание!
            </div>
        </div>
    )
}

export default About